# 작업 3유형

In [3]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p3_1.csv')
print(display(df. head(5)))

     fish   height
0  fish_1  33.74cm
1  fish_2  31.64cm
2  fish_3  27.49cm
3  fish_4  31.43cm
4  fish_5  27.56cm

None

## 122마리의 height 평균값을 m(미터) 단위로 소숫점 이하 5자리까지 실수 값만 출력하라

In [14]:
# df.info()
df['height_m'] = df.height.str.replace('cm','').astype('float')
result = round((df['height_m'].mean()/100),5)
print(result)

0.29951

## 모집단의 평균길이가 30cm인지 확인하려 일표본 t검정을 시행하여 확인하려한다. 검정통계량을 소숫점 이하 3자리까지 구하여라

In [15]:
from scipy.stats import ttest_1samp

s , p = ttest_1samp(df['height_m'],30)
result = round(s,3)
print(result)

-0.217

### 위의 통계량에 대한 p-값을 구하고(반올림하여 소숫점 이하 3째자리), 유의수준 0.05 이하에서 귀무가설과 대립가설 중 유의한 가설을 하나 택하시오

In [20]:
result_1 = round(p,3)
result_2 = '귀무'
print(result_1)
print(result_2)

0.829
귀무

## 조사결과 70%의 성인 남성이 3년동안에 적어도 1번 치과를 찾는다고 할 때, 21명의 성인 남성이 임의로 추출되었다고 하자.
### 21명 중 16명 미만이 치과를 찾았을 확률 (반올림하여 소숫점 이하 3자리)

In [21]:
from scipy.stats import binom
#21명 중
n = 21
#70%가
p = 0.7
#16명 미만이
k = 16

# P ( X < k) 계산
prob = binom.cdf(k-1,n,p)
print(round(prob,3))

0.637

### 적어도 19명이 치과를 찾았을 확률 (반올림하여 소숫점 이하 3자리)

In [22]:
from scipy.stats import binom

n = 21
p = 0.7
k = 19

#P(X >= k ) 계산
prob = 1 - binom.cdf(k-1, n, p)
print(round(prob,3))

0.027

# 작업 2유형
### 정시 도착 여부 (1:정시배송, 0 : 정시미배송)
### 평가지표 f1_score

In [39]:
import pandas as pd

x_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_train.csv')
x_test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_test.csv')
y_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_train.csv')

display(x_train.head())
display(y_train.head())

# print(x_train.info())
# print(x_train.nunique())
# print(x_train.isnull().sum())

drop_col = ['ID']

x_train_drop = x_train.drop(columns = drop_col)
x_test_drop = x_test.drop(columns = drop_col)
y = y_train['Reached.on.Time_Y.N']

x_train_dummies = pd.get_dummies(x_train_drop)
x_test_dummies = pd.get_dummies(x_test_drop)
x_test_dummies = x_test_dummies[x_train_dummies.columns]

# import sklearn
# print(sklearn.__all__)
# import sklearn.model_selection
# print(dir(sklearn.model_selection))

from sklearn.model_selection import train_test_split

X_T,X_V,Y_T,Y_V = train_test_split(x_train_dummies,y, test_size = 0.33 , random_state = 42)

from sklearn.ensemble import RandomForestClassifier

rf = RandomForestClassifier(random_state = 23)

rf.fit(X_T,Y_T)

predict_train = rf.predict(X_T)
predict_val = rf.predict(X_V)

from sklearn.metrics import f1_score

print('train f1 score : ' , f1_score(Y_T, predict_train))
print('val f1 score : ', f1_score(Y_V, predict_val))

predict_test = rf.predict(x_test_dummies)

result = pd.DataFrame({'ID' : x_test.ID , 'Reached.on.Time_Y.N' : predict_test})
result.to_csv('2test_2.csv',index = False)

result_check = pd.read_csv('2test_2.csv')
display(result_check)

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6045,A,Flight,4,3,266,5,high,F,5,1590
1,44,F,Ship,3,1,174,2,low,M,44,1556
2,7940,F,Road,4,1,154,10,high,M,10,5674
3,1596,F,Ship,4,3,158,3,medium,F,27,1207
4,4395,A,Flight,5,3,175,3,low,M,7,4833

     ID  Reached.on.Time_Y.N
0  6045                    0
1    44                    1
2  7940                    1
3  1596                    1
4  4395                    1

train f1 score :  1.0
val f1 score :  0.6744089589382

         ID  Reached.on.Time_Y.N
0      6811                    1
1      4320                    0
2      5732                    0
3      7429                    1
4      2191                    1
...     ...                  ...
4396   2610                    1
4397   3406                    1
4398  10395                    1
4399   3646                    0
4400    573                    1

[4401 rows x 2 columns]

## 작업 1유형
### CRIM 가장 큰 10개의 지역을 구하고, 10개의 지역의 CRIM 값을 그 중 가장 작은 값으로 대체하라. 그리고, AGE 컬럼 값이 80이상인 대체된 CRIM 평균값을 구하라

In [28]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p1_1.csv')
print(df.head())

df1 = df.copy()
df1 = df1.sort_values('CRIM',ascending = False).reset_index(drop=True)
df1.loc[:9,'CRIM'] = df1.loc[:9,'CRIM'].min()
print(df1)

result = df1.loc[df1.AGE >=80].CRIM.mean()
print(result)

      CRIM   ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD    TAX  PTRATIO  \
0  0.00632  NaN   2.31     0  0.538  6.575  65.2  4.0900    1  296.0     15.3
1  0.02731  NaN   7.07     0  0.469  6.421  78.9  4.9671    2  242.0     17.8
2  0.02729  NaN   7.07     0  0.469  7.185  61.1  4.9671    2  242.0     17.8
3  0.03237  NaN   2.18     0  0.458  6.998  45.8  6.0622    3  222.0     18.7
4  0.06905  0.0   2.18     0  0.458    NaN  54.2  6.0622    3  222.0     18.7

        B  LSTAT  MEDV
0  396.90   4.98  24.0
1  396.90   9.14  21.6
2  392.83   4.03  34.7
3  394.63   2.94  33.4
4  396.90   5.33  36.2
         CRIM    ZN  INDUS  CHAS    NOX     RM    AGE     DIS  RAD    TAX  \
0    25.94060   0.0  18.10     0  0.671  6.968   91.9  1.4165   24  666.0
1    25.94060   0.0  18.10     0  0.679  5.957  100.0  1.8026   24  666.0
2    25.94060   0.0  18.10     0  0.693  5.683  100.0  1.4254   24  666.0
3    25.94060   0.0  18.10     0  0.597  5.757  100.0  1.4130   24  666.0
4    25.94060   0.0  18.10     0  0.693  4.519  100.0  1.6582   24  666.0
..        ...   ...    ...   ...    ...    ...    ...     ...  ...    ...
501   0.01311  90.0   1.22     0  0.403  7.249   21.9  8.6966    5  226.0
502   0.01301  35.0   1.52     0  0.442  7.241   49.3  7.0379    1  284.0
503   0.01096  55.0   2.25     0  0.389  6.453   31.9  7.3073    1  300.0
504   0.00906  90.0   2.97     0  0.400  7.088   20.8  7.3073    1  285.0
505   0.00632   NaN   2.31     0  0.538  6.575   65.2  4.0900    1  296.0

     PTRATIO       B  LSTAT  MEDV
0       20.2  396.90  17.21  10.4
1       20.2   16.45  20.62   8.8
2       20.2  384.97  22.98   5.0
3       20.2    2.60  10.11  15.0
4       20.2   88.27  36.98   7.0
..       ...     ...    ...   ...
501     17.9  395.93   4.81  35.4
502     15.5  394.74   5.49  32.7
503     15.3  394.72   8.23  22.0
504     15.3  394.72   7.85  32.2
505     15.3  396.90   4.98  24.0

[506 rows x 14 columns]
5.759386625

In [29]:
# print(df1.isnull().sum())

RM_median = df1.RM.median()
df1.RM = df1.RM.fillna(RM_median)

result = round(abs(df.RM.std()-df1.RM.std()),3)
print(result)

0.027

In [39]:
dis_st1 = (df1.DIS.mean() - df1.DIS.std()*1.5)
dis_st2 = (df1.DIS.mean() + df1.DIS.std()*1.5)
print(dis_st1)
print(dis_st2)
result = df1.loc[(df1.DIS > dis_st2) | (df1.DIS < dis_st1)].DIS.sum()
print(result)

0.6364774978056191
6.9536078776884525
404.4101